In [2]:
import pandas as pd

In [32]:
df=pd.read_excel(r"C:\Users\asus\Desktop\Datasets\Raw data .xlsx")
df

    Id      Name  Lastname  Salary Department  Mobile no.
0    1     Anshu    Rajput   90000      Sales  8595787610
1    2    Manish     Kumar   62000  Marketing  8595787611
2    3     Aadil      Khan   70000    Finance  8595787612
3    4   Chandan    Thakur   80000         IT  8595787613
4    5      Aman     Anand   20000      Sales  8595787614
5    6     Badal     Singh   65000  Marketing  8595787615
6    7      Anil     Yadav   55000    Finance  8595787616
7    8     Akash     Verma   75000         IT  8595787617
8    9      Yash  Kushwaha   25000      Sales  8595787618
9   10  Abhishek     Yadav   95000  Marketing  8595787619
10  11   Aaditya     Yadav   10000    Finance  8595787620
11  12     Daksh   Chauhan   66000         IT  8595787621
12  13     Ayush     Singh   30000      Sales  8595787622
13  14      Arun     Singh   89000  Marketing  8595787623
14  15    Ashish     Rawat   90000    Finance  8595787624
15  16    Shivam    Thakur   91000         IT  8595787625
16  17     Swati    Thakur   92000      Sales  8595787626
17  18    Vineet      Ojha   93000  Marketing  8595787627
18  19    Sourav    Mathur   94000    Finance  8595787628
19  20    Yogesh    Sharma   95000         IT  8595787629

In [5]:
one=pd.DataFrame({
    'id':[1,2,3,4,5],
    'Name':['Akash','Anshu','Aadil','Badal','Chandan'],
    'subject_id':['sub1','sub2','sub3','sub4','sub5']})
one

   id     Name subject_id
0   1    Akash       sub1
1   2    Anshu       sub2
2   3    Aadil       sub3
3   4    Badal       sub4
4   5  Chandan       sub5

In [29]:
two=pd.DataFrame({
    'id':[1,2,3,14,15],
    'Name':['Anil','Aditya','Aadil','Bhupesh','Deepak'],
    'subject_id':['sub1','sub2','sub3','sub4','sub5']})
two

   id     Name subject_id
0   1     Anil       sub1
1   2   Aditya       sub2
2   3    Aadil       sub3
3  14  Bhupesh       sub4
4  15   Deepak       sub5

In [23]:
# joins in pandas
# Left join  (It can show the full left side data and compair with right side data.)
# Right join  (It can show the full right side data and compair with left side data.)
# Inner join  (It can show the common data in both left and right side data.)
# Outer join  (It can show the overall compairsion of left or right both side data at a time.)

In [24]:
# By default is apply inner join.
print(pd.merge(one,two,on='id'))

   id Name_x subject_id_x  Name_y subject_id_y
0   1  Akash         sub1    Anil         sub1
1   2  Anshu         sub2  Aditya         sub2
2   3  Aadil         sub3   Ayush         sub3

In [25]:
print(pd.merge(one,two,on='Name',how='left'))

   id_x     Name subject_id_x  id_y subject_id_y
0     1    Akash         sub1   NaN          NaN
1     2    Anshu         sub2   NaN          NaN
2     3    Aadil         sub3   NaN          NaN
3     4    Badal         sub4   NaN          NaN
4     5  Chandan         sub5   NaN          NaN

In [26]:
print(pd.merge(one,two,on='id',how='right'))

   id Name_x subject_id_x   Name_y subject_id_y
0   1  Akash         sub1     Anil         sub1
1   2  Anshu         sub2   Aditya         sub2
2   3  Aadil         sub3    Ayush         sub3
3  14    NaN          NaN  Bhupesh         sub4
4  15    NaN          NaN   Deepak         sub5

In [27]:
print(pd.merge(one,two,on='id',how='inner'))

   id Name_x subject_id_x  Name_y subject_id_y
0   1  Akash         sub1    Anil         sub1
1   2  Anshu         sub2  Aditya         sub2
2   3  Aadil         sub3   Ayush         sub3

In [28]:
print(pd.merge(one,two,on='id',how='outer'))

   id   Name_x subject_id_x   Name_y subject_id_y
0   1    Akash         sub1     Anil         sub1
1   2    Anshu         sub2   Aditya         sub2
2   3    Aadil         sub3    Ayush         sub3
3   4    Badal         sub4      NaN          NaN
4   5  Chandan         sub5      NaN          NaN
5  14      NaN          NaN  Bhupesh         sub4
6  15      NaN          NaN   Deepak         sub5

In [30]:
# apply these join methods behalf of two coloumns.
print(pd.merge(one,two,on=['id','Name']))

   id   Name subject_id_x subject_id_y
0   3  Aadil         sub3         sub3

In [47]:
print(pd.merge(one,two,on=['id','Name'],how='outer'))

   id     Name subject_id_x subject_id_y
0   1    Akash         sub1          NaN
1   1     Anil          NaN         sub1
2   2   Aditya          NaN         sub2
3   2    Anshu         sub2          NaN
4   3    Aadil         sub3         sub3
5   4    Badal         sub4          NaN
6   5  Chandan         sub5          NaN
7  14  Bhupesh          NaN         sub4
8  15   Deepak          NaN         sub5

In [31]:
# Group by: A groupby operation involves some combination of splitting the object, applying a function, and combining the results. 
#           This can be used to group large amounts of data and compute operations on these groups. 
#            Parameters: bymapping, function, label, pd.Grouper or list of such. Used to determine the groups for the groupby.

In [33]:
df

    Id      Name  Lastname  Salary Department  Mobile no.
0    1     Anshu    Rajput   90000      Sales  8595787610
1    2    Manish     Kumar   62000  Marketing  8595787611
2    3     Aadil      Khan   70000    Finance  8595787612
3    4   Chandan    Thakur   80000         IT  8595787613
4    5      Aman     Anand   20000      Sales  8595787614
5    6     Badal     Singh   65000  Marketing  8595787615
6    7      Anil     Yadav   55000    Finance  8595787616
7    8     Akash     Verma   75000         IT  8595787617
8    9      Yash  Kushwaha   25000      Sales  8595787618
9   10  Abhishek     Yadav   95000  Marketing  8595787619
10  11   Aaditya     Yadav   10000    Finance  8595787620
11  12     Daksh   Chauhan   66000         IT  8595787621
12  13     Ayush     Singh   30000      Sales  8595787622
13  14      Arun     Singh   89000  Marketing  8595787623
14  15    Ashish     Rawat   90000    Finance  8595787624
15  16    Shivam    Thakur   91000         IT  8595787625
16  17     Swati    Thakur   92000      Sales  8595787626
17  18    Vineet      Ojha   93000  Marketing  8595787627
18  19    Sourav    Mathur   94000    Finance  8595787628
19  20    Yogesh    Sharma   95000         IT  8595787629

In [35]:
h=df.groupby('Department')
h

In [36]:
for i,j in h:
    print(i)
    print(j)

Finance
    Id     Name Lastname  Salary Department  Mobile no.
2    3    Aadil     Khan   70000    Finance  8595787612
6    7     Anil    Yadav   55000    Finance  8595787616
10  11  Aaditya    Yadav   10000    Finance  8595787620
14  15   Ashish    Rawat   90000    Finance  8595787624
18  19   Sourav   Mathur   94000    Finance  8595787628
IT
    Id     Name Lastname  Salary Department  Mobile no.
3    4  Chandan   Thakur   80000         IT  8595787613
7    8    Akash    Verma   75000         IT  8595787617
11  12    Daksh  Chauhan   66000         IT  8595787621
15  16   Shivam   Thakur   91000         IT  8595787625
19  20   Yogesh   Sharma   95000         IT  8595787629
Marketing
    Id      Name Lastname  Salary Department  Mobile no.
1    2    Manish    Kumar   62000  Marketing  8595787611
5    6     Badal    Singh   65000  Marketing  8595787615
9   10  Abhishek    Yadav   95000  Marketing  8595787619
13  14      Arun    Singh   89000  Marketing  8595787623
17  18    Vineet     Ojha   93000  Marketing  8595787627
Sales
    Id   Name  Lastname  Salary Department  Mobile no.
0    1  Anshu    Rajput   90000      Sales  8595787610
4    5   Aman     Anand   20000      Sales  8595787614
8    9   Yash  Kushwaha   25000      Sales  8595787618
12  13  Ayush     Singh   30000      Sales  8595787622
16  17  Swati    Thakur   92000      Sales  8595787626

In [38]:
b=h['Salary'].sum()
b

Department
Finance      319000
IT           407000
Marketing    404000
Sales        257000
Name: Salary, dtype: int64

In [39]:
type(b)

pandas.core.series.Series

In [41]:
# Now we can change this data type in dataframe for performing the pandas methods.
k=pd.DataFrame(b)
k

            Salary
Department
Finance     319000
IT          407000
Marketing   404000
Sales       257000

In [44]:
k.sort_values('Salary',ascending=False)

            Salary
Department
IT          407000
Marketing   404000
Finance     319000
Sales       257000

In [43]:
# Highest salary find by dapartment wise.but at this point there is a situation 
# when two or more department can have same values then the data can be only once,so we can use another method to achieve this. 
k.sort_values('Salary',ascending=False).head(1)

            Salary
Department
IT          407000

In [50]:
k[k.Salary==k['Salary'].max()]

            Salary
Department
IT          407000

In [ ]:
# Now Group by also perform behalf of two columns.